app/views/parties/show.html.erb

    <tbody>
      <% @party.orders.each do |order| %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."party_id" = $1  [["party_id", 5]]