app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods"
---
  def index
    @foods = Food.all

INSERT INTO "foods" ("name", "description", "category", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Pad Thai"], ["description", "noodles yo"], ["category", "entree"], ["price", 21], ["created_at", "2016-04-22 16:26:59.196373"], ["updated_at", "2016-04-22 16:26:59.196373"]]
---
  def create
    food = Food.create food_params

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @food = Food.find(params[:id])

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @food = Food.find(params[:id])

DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 14]]
---
  def destroy
    Food.destroy(params[:id])