app/controllers/orders_controller.rb

  def index
    @orders = Order.where(user_id: current_user.id)
    @orders = Order.all.sort_by {|m| m.created_at }
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]
SELECT "orders".* FROM "orders"

  def create
    if params[:appetizer_ids] then Order.create order_params.merge food_id: params[:appetizer_ids][0] end
---
INSERT INTO "orders" ("party_id", "user_id", "food_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["party_id", 1], ["user_id", 3], ["food_id", 1], ["created_at", "2016-04-21 22:40:01.790632"], ["updated_at", "2016-04-21 22:40:01.790632"]]

  def new
    @order   = Order.new
    @foods   = Food.all
    @entrees = Food.where category: "entree"
    @desserts = Food.where category: "dessert"
    @appetizers = Food.where category: "appetizer"
    @users   = User.all
    @parties = Party.all
---
SELECT "foods".* FROM "foods"
SELECT "foods".* FROM "foods" WHERE "foods"."category" = $1  [["category", "appetizer"]]
SELECT "users".* FROM "users"
SELECT "parties".* FROM "parties"

  def show
    @foods = Order.where params[:food_id]
    @order = Order.find params[:id]
---
SELECT "orders".* FROM "orders"
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 2]]

  def update
    order = Order.find params[:id]
    order.update(is_completed: params[:is_completed])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 72]]
UPDATE "orders" SET "is_completed" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["is_completed", "t"], ["updated_at", "2016-04-22 20:05:21.618512"], ["id", 69]]

  def destroy
    Order.destroy(params[:id])
---
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 83]]