app/controllers/parties_controller.rb

SELECT "parties".* FROM "parties"
---
  def index
    @parties = Party.all

INSERT INTO "parties" ("quantity", "table") VALUES ($1, $2) RETURNING "id"  [["quantity", 6], ["table", 10]]
---
  def create
    party = Party.create party_params

SELECT  "parties".* FROM "parties" WHERE "parties"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."party_id" = $1  [["party_id", 5]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "foods".* FROM "foods" INNER JOIN "orders" ON "foods"."id" = "orders"."food_id" WHERE "orders"."party_id" = $1  [["party_id", 1]]
---
  def show
    @party = Party.find(params[:id])
    @orders = Order.where( party_id: @party.id )
    @total = 0
    @party.foods.each do |food|

SELECT  "parties".* FROM "parties" WHERE "parties"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "parties" WHERE "parties"."id" = $1  [["id", 1]]
---
  def destroy
    @party = Party.find params[:id]
    @party.destroy