app/controllers/users_controller.rb

INSERT INTO "users" ("name", "username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    user = User.create user_params

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def profile
    # check if the user is logged in
    # @order = Order.new
    @user = current_user
    # @orders = Order.where user_id: @user.id
    # @orders = Order.find_by(user_id: session[:user_id])
    if session[:user_id]
      @user = User.find session[:user_id]

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
  def destroy
    User.destroy(params[:id])